tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/formula-analytics"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Optimizer for PNG files
brew "pngcrush"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Watch files and take action when they change
brew "tfenv"
brew "tflint"
brew "watchman"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Control your Elgato key lights
cask "elgato-control-center"
# Configure Wave Link and Wave XLR
cask "elgato-wave-link"
cask "font-abel"
cask "font-fjalla-one"
# Variable font designed for display
cask "font-inter"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Sans-serif signage typeface with a gentle character
cask "font-signika"
cask "font-hack"
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

cask "grammarly"
# Tool to prevent the system from going into sleep mode
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform

mas "1Password for Safari", id: 1569813296
mas "Xcode", id: 497799835
